## Loading modules and packages

In [19]:
from .data_generator import generate_property
from .data_generator import generate_customer
from .data_generator import generate_agent
from .data_generator import generate_transaction
from .data_generator import generate_date
from .data_generator import generate_sales
import pandas as pd
import random

## Declaring Constants

In [20]:
NUMBER_OF_PROPERTIES=5000
NUMBER_OF_CUSTOMERS=3000
NUMBER_OF_AGENTS=2000
NUMBER_OF_TRANSACTIONS=4000

## Generating Customer Data

In [21]:
customer_data = [generate_customer(customer_id) for customer_id in range(NUMBER_OF_CUSTOMERS)]

pd.DataFrame(customer_data)
#.to_csv('M2/DB/data_csv/customer.csv', index=False)

,customer_id,customer_name,customer_surname,email,phone,country,city,address,zip_code,birthday,gender
0,0,Alexander,Fowler,douglas37@example.com,753-398-3020x36485,Isle of Man,North Garrettmouth,1648 Harper Wall,07494,2002-08-01,Male
1,1,Shannon,Gilbert,newmanrobert@example.com,(891)715-0373x54980,Hong Kong,East Lisa,0946 Watkins Locks Apt. 946,80170,1972-08-10,Prefer Not To Say
2,2,Charles,Coleman,wandrews@example.com,944.464.7583x792,Mauritania,North Stephaniechester,60583 Farrell Keys Suite 544,35358,1946-03-14,Prefer Not To Say
3,3,Joseph,Nguyen,dawsonkatie@example.com,(560)321-4514,Hungary,East Jack,90931 Lewis Pines,70159,1956-05-04,Male
4,4,Christopher,Lopez,smithcharles@example.org,+1-423-820-2931,Chad,Johnsonstad,149 Harrison Forest Suite 834,01056,1933-12-21,Prefer Not To Say
...,...,...,...,...,...,...,...,...,...,...,...
2995,2995,Justin,Mccullough,wilsonpaige@example.org,224-387-7383x078,Mauritius,West Jayshire,89049 Brenda Loop,33355,2001-08-07,Male
2996,2996,James,Olson,michael12@example.com,382-782-6541,Cambodia,Brandonberg,13213 Young Court,44130,1950-05-11,Female
2997,2997,Tracy,Kelly,jenniferleblanc@example.org,7822949956,Moldova,West Carolchester,292 Green Estate Apt. 557,89571,1933-11-22,Prefer Not To Say
2998,2998,Tracy,Washington,davidsmith@example.com,+1-370-868-5963x442,Saint Kitts and Nevis,Moralesport,49924 Douglas Station Apt. 865,83772,1964-07-31,Female
2999,2999,Kelly,Butler,stevensdaniel@example.org,476.305.7664,Peru,Port Stevemouth,7975 Johnson Forges,98006,1956-10-06,Male

## Generating Agent Data

In [22]:
agent_data = [generate_agent(agent_id) for agent_id in range(NUMBER_OF_AGENTS)] 
pd.DataFrame(agent_data)
#.to_csv('M2/DB/data_csv/agent.csv', index=False)

,agent_id,agent_name,agent_surname,email,phone,experience_years
0,0,Stacey,Anderson,frank15@example.com,(501)898-8964x38407,61
1,1,Jessica,Thompson,wsmith@example.org,(936)696-8989x446,72
2,2,Benjamin,Martinez,sara89@example.org,001-430-964-7649x680,33
3,3,Brittany,Oconnell,zfrazier@example.org,718-206-9897x852,71
4,4,Felicia,Young,james77@example.org,700-434-2945x799,21
...,...,...,...,...,...,...
1995,1995,Rita,Stanley,smithshelby@example.net,668-606-0302,58
1996,1996,Troy,Gray,pbryant@example.org,200.260.2467x40287,76
1997,1997,Jermaine,Garrison,ugonzalez@example.com,001-286-613-2324x673,24
1998,1998,Michael,Buchanan,walkerdavid@example.com,001-447-787-3241,77
1999,1999,Holly,Pace,katkinson@example.net,688-243-6980x1874,43

## Generating Property Data

In [23]:
property_data = [generate_property(property_id) for property_id in range(NUMBER_OF_PROPERTIES)]
pd.DataFrame(property_data)
#.to_csv('M2/DB/data_csv/property.csv', index=False)

,property_id,property_type,country,city,street,building_number,square_footage,number_of_bedrooms,number_of_bathrooms,year_built
0,0,Loft,Guinea-Bissau,North Jennyton,Bell Mission,80329,14596,3,7,2004
1,1,Loft,Austria,South Robertchester,Myers Club,033,2820,10,3,2018
2,2,Loft,Philippines,Port Randall,Cortez Rest,28257,6764,5,2,2006
3,3,Loft,Vietnam,Lake Wesley,Coleman Common,5605,12642,3,2,2018
4,4,Duplex,Comoros,Medinahaven,Jared Alley,26276,17918,10,6,2022
...,...,...,...,...,...,...,...,...,...,...
4995,4995,Villa,Bangladesh,Marthaton,Thomas Mountains,95985,14870,7,1,2002
4996,4996,Cottage,Barbados,Alvarezshire,Matthews Falls,03758,19335,7,10,2000
4997,4997,Condo,Holy See (Vatican City State),North Morgan,Brown Village,0249,7447,1,5,2011
4998,4998,Loft,Syrian Arab Republic,North Leon,Meyer Shore,17066,10200,9,9,2004
4999,4999,Studio,Malawi,South Kristine,Kathy Corners,60568,10901,1,4,2009

## Generating Transaction Data

In [29]:
transaction_data = [generate_transaction(transaction_id) for transaction_id in range(NUMBER_OF_TRANSACTIONS)] 
pd.DataFrame(transaction_data)
#.to_csv('M2/DB/data_csv/transactions.csv', index=False)

## Generating Dates Data

In [25]:
from datetime import datetime

# Define the start and end dates as strings
start_date = "2000-01-01"
end_date = "2023-12-31"

# Convert the date strings to datetime objects
start_date_obj = datetime.strptime(start_date, "%Y-%m-%d")
end_date_obj = datetime.strptime(end_date, "%Y-%m-%d")

# Calculate the difference between the two dates
number_of_days = (end_date_obj - start_date_obj).days
number_of_days

8765

In [26]:
dates_data = [generate_date(date_id) for date_id in range(number_of_days+1)] 
pd.DataFrame(dates_data)
#.to_csv('M2/DB/data_csv/date.csv', index=False)

,date_id,date,month,month_name,year,quarter,day_of_month,day_of_year,day_of_week_number,day_of_week_name,week_of_year,week_of_month
0,0,2000-01-01,1,January,2000,1,1,1,6,Saturday,52,1
1,1,2000-01-02,1,January,2000,1,2,2,7,Sunday,52,1
2,2,2000-01-03,1,January,2000,1,3,3,1,Monday,1,1
3,3,2000-01-04,1,January,2000,1,4,4,2,Tuesday,1,1
4,4,2000-01-05,1,January,2000,1,5,5,3,Wednesday,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...
8761,8761,2023-12-27,12,December,2023,4,27,361,3,Wednesday,52,4
8762,8762,2023-12-28,12,December,2023,4,28,362,4,Thursday,52,4
8763,8763,2023-12-29,12,December,2023,4,29,363,5,Friday,52,5
8764,8764,2023-12-30,12,December,2023,4,30,364,6,Saturday,52,5
8765,8765,2023-12-31,12,December,2023,4,31,365,7,Sunday,52,5

## Generating Sales Data

In [27]:
sales_data = []


for transaction_id in range(1, NUMBER_OF_TRANSACTIONS + 1):
    property_id = random.randint(1, len(property_data))
    customer_id = random.randint(1, len(customer_data))
    agent_id = random.randint(1, len(agent_data))
    date_id = random.randint(1, len(dates_data))
    
    sale = generate_sales(transaction_id, property_id, customer_id, agent_id, date_id)
    sales_data.append(sale)

In [28]:
pd.DataFrame(sales_data)
#.to_csv('M2/DB/data_csv/sales.csv', index=False)

      transaction_id  property_id  customer_id  agent_id  date_id
0                  1         1610          508      1145     8231
1                  2         3912          569      1907       73
2                  3         3916         2434      1524     7284
3                  4         4739         1571       535     4865
4                  5         1209         2492      1444     8039
...              ...          ...          ...       ...      ...
3995            3996            7         1511       950     8720
3996            3997         1870          392      1568     3745
3997            3998          577         1008       105      862
3998            3999         3025         1226       853     5758
3999            4000         3752         1916         9     5038

[4000 rows x 5 columns]